
## Assignment - Part 1, Querying a Database

This directory contains a file `rpg_db.sqlite3`, a database for a hypothetical
webapp role-playing game. This test data has dozens-to-hundreds of randomly
generated characters across the base classes (Fighter, Mage, Cleric, and Thief)
as well as a few Necromancers. Also generated are Items, Weapons, and
connections from characters to them. Note that, while the name field was
randomized, the numeric and boolean fields were left as defaults.

Use `sqlite3` to load and write queries to explore the data, and answer the
following questions:

In [5]:
import sqlite3
import os
import pandas as pd

os.listdir()

['Untitled.ipynb',
 'buddymove_holidayiq.sqlite3.db',
 'README.md',
 'buddymove_holidayiq.csv',
 'buddymove_holidayiq.py',
 'schema.png',
 '.ipynb_checkpoints',
 'rpg_db.sqlite3']

In [6]:
# connect to database
conn = sqlite3.connect('rpg_db.sqlite3')

# cursor to look at it, use it to execute queries
curs = conn.cursor()

# query 
pd.read_sql(query, conn)

   count(*)
0       302

In [9]:
# How many total Characters are there? 302

# cursor to look at it, use it to execute queries
curs = conn.cursor()

# query
query = 'SELECT count(*) FROM charactercreator_character'

# execute, fetch
curs.execute(query).fetchall()

[(302,)]

In [10]:
# How many of each specific subclass?

In [13]:
# How many total Items? 174

curs2 = conn.cursor()
query = 'SELECT count(*) FROM armory_item'
curs2.execute(query).fetchall()

[(174,)]

In [15]:
# How many of the Items are weapons? 138 How many are not? 174 - 138

curs3 = conn.cursor()
query = 'SELECT item_ptr_id, count(*) FROM armory_weapon'
curs3.execute(query).fetchall()
pd.read_sql(query, conn)

   item_ptr_id  count(*)
0          138        37

In [17]:
# How many Items does each character have? (Return first 20 rows)

curs4 = conn.cursor()
query = '''SELECT character_id, count(item_id)
FROM charactercreator_character_inventory 
GROUP BY character_id
LIMIT 20'''
curs4.execute(query).fetchall()
pd.read_sql(query, conn)

    character_id  count(item_id)
0              1               3
1              2               3
2              3               2
3              4               4
4              5               4
5              6               1
6              7               5
7              8               3
8              9               4
9             10               4
10            11               3
11            12               3
12            13               4
13            14               4
14            15               4
15            16               1
16            17               5
17            18               5
18            19               3
19            20               1

In [18]:
# How many Weapons does each character have? (Return first 20 rows)

curs5 = conn.cursor()
query = '''SELECT character_id, count(a.item_id)
FROM charactercreator_character_inventory as a,
armory_item as b, 
armory_weapon as c
WHERE a.item_id = b.item_id
AND b.item_id = c.item_ptr_id
GROUP BY a.character_id
LIMIT 20'''
curs5.execute(query).fetchall()
pd.read_sql(query, conn)

    character_id  count(a.item_id)
0              5                 2
1              7                 1
2             11                 1
3             20                 1
4             22                 1
5             23                 1
6             26                 1
7             27                 3
8             29                 2
9             30                 1
10            32                 1
11            34                 1
12            35                 2
13            36                 3
14            37                 2
15            38                 2
16            39                 2
17            40                 1
18            41                 1
19            47                 1

In [19]:
# On average, how many Items does each Character have? ~ 89
curs6 = conn.cursor()
query = '''SELECT avg(item_id) avg_item
FROM charactercreator_character_inventory'''
curs6.execute(query).fetchall()
pd.read_sql(query, conn)

    avg_item
0  89.178174

In [20]:
# On average, how many Weapons does each character have? ~ 157
curs7 = conn.cursor()
query = '''SELECT avg(c.item_ptr_id)
FROM charactercreator_character_inventory as a,
armory_item as b, 
armory_weapon as c
WHERE a.item_id = b.item_id
AND b.item_id = c.item_ptr_id'''
curs7.execute(query).fetchall()
pd.read_sql(query, conn)

   avg(c.item_ptr_id)
0          157.034483

In [21]:
import pandas as pd
import sqlite3
from pandas import DataFrame 

df = pd.read_csv('/Users/elliotgunn/Desktop/DS-Unit-3-Sprint-2-SQL-and-Databases/module1-introduction-to-sql/buddymove_holidayiq.csv')
df.shape
df.columns

Index(['User Id', 'Sports', 'Religious', 'Nature', 'Theatre', 'Shopping',
       'Picnic'],
      dtype='object')

## Assigment - Part 2, Making and populating a Database

Load the data (use `pandas`) from the provided file `buddymove_holidayiq.csv`
(the [BuddyMove Data
Set](https://archive.ics.uci.edu/ml/datasets/BuddyMove+Data+Set)) - you should
have 249 rows, 7 columns, and no missing values. The data reflects the number of
place reviews by given users across a variety of categories (sports, parks,
malls, etc.).

Using the standard `sqlite3` module:

- Open a connection to a new (blank) database file `buddymove_holidayiq.sqlite3`
- Use `df.to_sql`
  ([documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_sql.html))
  to insert the data into a new table `review` in the SQLite3 database

Then write the following queries (also with `sqlite3`) to test:

- Count how many rows you have - it should be 249!
- How many users who reviewed at least 100 `Nature` in the category also
  reviewed at least 100 in the `Shopping` category?
- (*Stretch*) What are the average number of reviews for each category?

Your code (to reproduce all above steps) should be saved in
`buddymove_holidayiq.py`, and added to the repository along with the generated
SQLite database.

In [27]:
conn = sqlite3.connect('buddymove_holidayiq.sqlite3.db')

In [30]:
df.to_sql('review', conn) # Insert the values from the csv file into the table 'X'

ValueError: Table 'review' already exists.

In [32]:
# look at table 
curs = conn.cursor()
query = 'SELECT * FROM review LIMIT 20'
pd.read_sql(query, conn)

    index  User Id  Sports  Religious  Nature  Theatre  Shopping  Picnic
0       0   User 1       2         77      79       69        68      95
1       1   User 2       2         62      76       76        69      68
2       2   User 3       2         50      97       87        50      75
3       3   User 4       2         68      77       95        76      61
4       4   User 5       2         98      54       59        95      86
5       5   User 6       3         52     109       93        52      76
6       6   User 7       3         64      85       82        73      69
7       7   User 8       3         54     107       92        54      76
8       8   User 9       3         64     108       64        54      93
9       9  User 10       3         86      76       74        74     103
10     10  User 11       3        107      54       64       103      94
11     11  User 12       3        103      60       63       102      93
12     12  User 13       3         64      82       82        75      69
13     13  User 14       3         93      54       74       103      69
14     14  User 15       3         63      82       81        78      69
15     15  User 16       3         82      79       75        75      82
16     16  User 17       5         59     131      103        54      86
17     17  User 18       5         56     124      108        56      85
18     18  User 19       4         85      67      111        65      72
19     19  User 20       5        114      83       65       114     102

In [28]:
# count rows
curs.execute('''
SELECT count(*)
FROM review
''')
print(curs.fetchall())

[(249,)]

In [44]:
# How many users who reviewed at least 100 Nature in the category 
# also reviewed at least 100 in the Shopping category?

curs2 = conn.cursor()
query = '''
SELECT count(*)
FROM review 
WHERE Nature >= 100 AND Shopping >= 100'''
pd.read_sql(query, conn)

   count(*)
0        78

In [58]:
# What are the average number of reviews for each category?
query = '''
SELECT *, avg(*)
FROM review
GROUP BY *'''
pd.read_sql(query, conn)

DatabaseError: Execution failed on sql '
SELECT *, avg(*)
FROM review
GROUP BY *': near "*": syntax error